for i in range(10):
       print(i)

# ვქმინით  for  ციკლს "for" ტერმინის დახმარებით "ვქმნით": unknown word
#ვქმნით საიტერაციო ცვლადს და უწერთ რომ არის 10 რიცხვების სიმრავლეში (list-ში range-ის დახმარებით) "ვქმნით" unknown word.
#range(10) ქმნის რიცხვთა სიმრავლეს  რომელიც იწყება 0-ით და მთვრდება 9-ით(10-ით არა რადგან 10-ით დმთავრების შემთხვევაში რიცხვთა სიმრავლე  11
#ელემენტის გან ინქნებოდა შემხვგარი "ქმნის" unknown word.
#print(i) ტერმინალში გამოაქვს საიტერაციო ცვლადის მნიშვნელობა  საიტერაციო ცვლადის მნიშვნელობა არის  სიხრალეში  ვყოფ თითეული ელემენტის მნიშვნელობა
#სიხრალემი  თითეულ ელემენტს აქვს რიგიტი ხომერი ამ რიგით ნომრებს იტერაცის ცვალადი გადაუთვლის და უპრობლემოდ დაბეჭდავს








