// 2)ახსენით თითოეული ეს მეთოდი კომენტარებით თუ რას აკეთებს(cloneNode,createElement,appendChild,replaceChild)

//1. createElement
//ეს მეთოდი გამოიყენება ახალი HTML ელემენტის შესაქმნელად. მაგალითად, თუ გვინდა დავამატოთ ახალი ღილაკი ან პარაგრაფი ვებგვერდზე, ამ მეთოდით შეგვიძლია ვთქვათ: "შექმენი ახალი პარაგრაფი".

//2. appendChild
//ამ მეთოდით ვამატებთ უკვე შექმნილ ელემენტს რომელიმე მშობელ ელემენტში. ანუ თუ რაღაც ახალი შევქმენით (მაგალითად, ღილაკი), appendChild-ს ვიყენებთ იმისთვის, რომ ეს ღილაკი დავამატოთ ვებგვერდზე.

///3. cloneNode
//ეს მეთოდი ქმნის ელემენტის ასლს — ანუ კოპიას. შეგვიძლია მხოლოდ ელემენტის სტრუქტურა დავაკოპიროთ, ან თუ დავურთავთ დამატებით პარამეტრს, შიგთავსიც გადაიტანს (მაგალითად ტექსტი ან შიდა ელემენტები).

//4. replaceChild
//ამ მეთოდით ვცვლით ერთ ელემენტს მეორეთი. მაგალითად, თუ ვებგვერდზე არის სურათი და გვინდა, რომ სხვა სურათი დავაყენოთ მის ადგილას — ეს მეთოდი ზუსტად ამას აკეთებს: ძველი ელემენტის ადგილას ახალს სვამს.<!DOCTYPE html>
